app/controllers/messages_controller.rb

INSERT INTO "messages" ("subject", "body", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["subject", "Working?"], ["body", "asdfasdf"], ["user_id", 1], ["created_at", "2021-02-03 15:02:43.924186"], ["updated_at", "2021-02-03 15:02:43.924186"]]
---
  def create
    @message = Message.new(message_params)
    @message.user = @current_user
    puts @message.save!

SELECT "messages".* FROM "messages" WHERE "messages"."user_id" = $1 AND "messages"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 3], ["LIMIT", 1]]
DELETE FROM "messages" WHERE "messages"."id" = $1  [["id", 3]]
---
  def destroy
    @message = @current_user.messages.find(params[:id])
    @message.destroy