app/controllers/vineyards_controller.rb

    def index
        @vineyards = Vineyard.all
---
SELECT "vineyards".* FROM "vineyards"