app/controllers/wines_controller.rb

    def index
        @wines = Wine.all
---
SELECT "wines".* FROM "wines"

    def create
        puts params
        @wine = Wine.new(name: params[:wine][:name],varietal: params[:wine][:varietal], vintage: params[:wine][:vintage], price_min: params[:wine][:price_min],
        price_max: params[:wine][:price_max], size: params[:wine][:size], category: params[:wine][:category])
        @vineyard = Vineyard.new(vineyard_name: params[:vineyard][:vineyard_name])
        puts @vineyard.inspect
        # @wine.build_vineyard
        if @vineyard.save
            @wine.vineyard = @vineyard
            @wine.user = @current_user
            if @wine.save
---
INSERT INTO "vineyards" ("created_at", "updated_at", "vineyard_name") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2021-02-03 14:42:27.067871"], ["updated_at", "2021-02-03 14:42:27.067871"], ["vineyard_name", "asdf"]]
INSERT INTO "vineyards" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2021-02-03 07:25:29.767753"], ["updated_at", "2021-02-03 07:25:29.767753"]]
INSERT INTO "wines" ("vintage", "price_min", "price_max", "size", "user_id", "vineyard_id", "created_at", "updated_at", "name", "varietal", "category") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

    def update
        @wine = @current_user.wines.find(params[:id])

        if @wine.update(wine_params)
---
SELECT "wines".* FROM "wines" WHERE "wines"."user_id" = $1 AND "wines"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 26], ["LIMIT", 1]]
UPDATE "wines" SET "vintage" = $1, "updated_at" = $2, "category" = $3 WHERE "wines"."id" = $4  [["vintage", 1998], ["updated_at", "2021-02-03 17:23:18.655348"], ["category", "White"], ["id", 6]]

    def destroy
        @wine = @current_user.wines.find(params[:id])
        @wine.destroy
---
SELECT "wines".* FROM "wines" WHERE "wines"."user_id" = $1 AND "wines"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 25], ["LIMIT", 1]]
DELETE FROM "wines" WHERE "wines"."id" = $1  [["id", 25]]

    def set_wine
        @wine = Wine.find(params[:id])
---
SELECT "wines".* FROM "wines" WHERE "wines"."id" = $1 LIMIT $2  [["id", 33], ["LIMIT", 1]]